app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
      if @user.save
---
INSERT INTO "users" ("email", "password_digest", "confirmed_at", "lastname", "firstname", "address", "username", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"

  def update
    @user = User.find(params[:id])
    #respond_to do |format|
      if @user.update_attributes(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 980190962], ["LIMIT", 1]]
UPDATE "users" SET "email" = $1, "username" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["email", "foo@bar.com"], ["username", "Foo Bar"], ["updated_at", "2018-02-19 15:47:36.264190"], ["id", 762146111]]